{
    "exchange": "Börse",
    "wallet": "Brieftasche",
    "unknown": "Unbekannt",
    "unrecoverable": "Nicht wiederherstellbar",
    "reset": "Zurücksetzen",
    "settings": "Einstellungen",
    "basic": "Grundlegend",
    "advanced": "Erweitert",
    "unit": "Einheit",
    "cancel": "Abbrechen",
    "transactionHistory": "Transaktionsverlauf",
    "transactionFee": "Transaktionsgebühr",
    "toggleColorScheme": "Farbschema wechseln",
    "balance": "Kontostand",
    "send": "Senden",
    "receive": "Empfangen",
    "selectSenderAddress": "Absenderadresse auswählen",
    "recipentAddress": "Empfängeradresse",
    "receiveAddress": "Empfangsadresse",
    "copy": "Kopieren",
    "copied": "Kopiert",
    "receiveBitcoinToExchange": "Bitcoin an Börse empfangen",
    "sendBitcoinFromExchange": "Bitcoin von Börse senden",
    "receiveBitcoinToWallet": "Bitcoin an Wallet empfangen",
    "sendBitcoinFromWallet": "Bitcoin von Wallet senden",
    "yourUtxos": "Ihre UTXOs",
    "memoryPool": "Memory Pool",
    "sourceCode": "Quellcode",
    "noTransactionsFound": "Keine Transaktionen gefunden...",
    "pasteAddressHere": "Adresse hier einfügen",
    "setSpeedTo1x": "Geschwindigkeit auf 1x setzen",
    "setSpeedTo10x": "Geschwindigkeit auf 10x setzen",
    "learnMore": "Mehr erfahren",
    "amountToSend": "Zu sendender Betrag",
    "exchangeExplanationPart1": "Eine Börse ist eine Plattform, auf der Sie Bitcoin (und andere Kryptowährungen) mit regulärem Geld (wie USD, EUR) oder anderen digitalen Vermögenswerten kaufen, verkaufen oder handeln können. Sie funktioniert wie ein Marktplatz - Sie zahlen Geld ein und nutzen es dann, um Bitcoin zu kaufen, den Sie später auf Ihre eigene Wallet auszahlen können.",
    "exchangeExplanationPart2": "Auf einer Börse <bold>kontrollieren Sie nicht die privaten Schlüssel</bold> zu Ihrem Bitcoin - die Börse verwahrt sie für Sie. Deshalb sagt man: <italic>„Not your keys, not your Bitcoin“</italic> - wenn Sie die Schlüssel nicht kontrollieren, besitzen Sie Ihren Bitcoin nicht vollständig.",
    "walletExplanationPart1": "Eine Wallet ist ein Werkzeug, mit dem Sie Bitcoin speichern, senden und empfangen können. Im Gegensatz zu einer Börse gibt eine Wallet <bold>Ihnen die Kontrolle über die privaten Schlüssel</bold> - das bedeutet, dass Sie Ihren Bitcoin wirklich besitzen. Wallets können Apps auf Ihrem Telefon/Computer (Software-Wallets) oder spezielle Geräte (Hardware-Wallets) sein. Man sagt: <italic>„Not your keys, not your Bitcoin“</italic>, weil bei einer Wallet die Schlüssel Ihnen gehören - und damit auch Ihr Bitcoin.",
    "walletExplanationPart2": "Ihr Bitcoin selbst befindet sich immer auf der Blockchain, nicht in Ihrem Telefon oder Gerät. Die Wallet <bold>bewahrt lediglich Ihren privaten Schlüssel sicher auf</bold>. Wenn Sie die Wallet verlieren, können Sie den Zugriff mit Ihrem privaten Schlüssel wiederherstellen (normalerweise als 12 oder 24 Wiederherstellungswörter).",
    "recipientAddressExplanationPart1": "Die Empfängeradresse ist wie die „Kontonummer“ für Bitcoin. Sie gibt dem Netzwerk <bold>an, wohin der Bitcoin gesendet werden soll</bold>.",
    "recipientAddressExplanationPart2": "In dieser Übungs-App können Sie eine Empfängeradresse erhalten, indem Sie zu Ihrer Wallet gehen, auf „Empfangen“ klicken und die dort angezeigte Adresse kopieren. Fügen Sie diese Adresse hier ein, um das Senden von Bitcoin an Ihre Wallet zu simulieren.",
    "importantReminder": "Wichtiger Hinweis",
    "doubleCheckAddress1": "Überprüfen Sie immer die Empfängeradresse, bevor Sie Bitcoin senden. Schon ein falscher Buchstabe oder eine falsche Zahl bedeutet, dass der Bitcoin an den falschen Ort geht - und einmal gesendete Transaktionen können nicht rückgängig gemacht werden.",
    "language": "Sprache",
    "dark": "Dunkel",
    "light": "Hell",
    "blockchain": "Blockchain",
    "blockchainExplanationPart1": "Die Bitcoin-Blockchain ist ein <bold>öffentliches Verzeichnis</bold>, das jede jemals getätigte Bitcoin-Transaktion aufzeichnet. Sie besteht aus Blöcken, von denen jeder eine Liste verifizierter <bold>Transaktionen</bold> enthält, die in einem bestimmten Zeitraum stattgefunden haben.",
    "blockchainExplanationPart2": "Blöcke sind miteinander verbunden und bilden eine sichere <bold>Kette von Blöcken</bold>. Diese Struktur gewährleistet die Integrität und chronologische Reihenfolge aller Transaktionen.",
    "blockchainExplanationPart3": "Wenn Sie möchten, <bold>können Sie auch die gesamte Bitcoin-Blockchain selbst herunterladen</bold>. Dazu müssen Sie Bitcoin-Software auf Ihrem Computer installieren oder ein spezielles Gerät verwenden. So können Sie Transaktionen unabhängig überprüfen und direkt am Bitcoin-Netzwerk teilnehmen.",
    "blockMiningTime": "Block-Mining-Zeit",
    "blockMiningExplanation": "Bitcoin-Miner finden ungefähr alle <bold>10 Minuten</bold> einen neuen Block. Dieser Countdown simuliert diesen Zyklus: Wenn er null erreicht, beginnt er von neuem - genau wie nach jedem Block eine neue ~10-minütige Wartezeit auf den nächsten Block beginnt.",
    "utxo": "UTXO (Unverbrauchter Transaktionsausgang)",
    "utxoExplanationPart1": "Wenn Sie Bitcoin empfangen, kommt er in Stücke, die UTXOs genannt werden. Sie können sie wie Münzen in Ihrer Wallet betrachten: Wenn Ihnen jemand 0,3 BTC und später weitere 0,2 BTC sendet, hält Ihre Wallet zwei „Münzen“ (zwei UTXOs). Wenn Sie Bitcoin senden, verwendet Ihre Wallet diese Münzen (UTXOs) als Eingaben.",
    "utxoExplanationPart2": "Die Anzahl der UTXOs wirkt sich auf die Transaktionsgebühr aus - mehr UTXOs bedeuten normalerweise eine höhere Gebühr, selbst wenn der Gesamtbetrag derselbe ist. Deshalb kann es manchmal sinnvoll sein, Ihre UTXOs zu konsolidieren (kleinere in größere zusammenzufassen), wenn die Gebühren niedrig sind.",
    "memoryPoolExplanationPart1": "Wenn Sie eine Bitcoin-Transaktion senden, geht sie nicht direkt in die Blockchain. Zuerst gelangt sie in einen Wartespeicher, den Memory Pool (oder <italic>Mempool</italic>) genannt. Denken Sie daran wie an eine <bold>Schlange bei der Post</bold>: Ihre Transaktion wartet dort, bis ein Miner sie aufnimmt und in den nächsten Block einfügt.",
    "memoryPoolExplanationPart2": "Wenn Sie eine <bold>höhere Gebühr</bold> setzen, wird Ihre Transaktion normalerweise schneller aufgenommen. Bei niedriger Gebühr kann sie länger im Mempool bleiben, bis Platz verfügbar ist.",
    "spent": "Ausgegeben",
    "unspent": "Unverbraucht",
    "xUnspentUtxo": "{{count}} unverbrauchte UTXO(s)",
    "xSpentUtxo": "{{count}} ausgegebene UTXO(s)",
    "noUtxosAvailable": "Keine UTXOs verfügbar...",
    "attention": "Achtung",
    "doubleCheckAddress2": "Überprüfen Sie immer die Adresse, bevor Sie Gelder senden oder teilen. Wenn Sie die falsche Adresse verwenden, kann Ihr Bitcoin für immer verloren sein.",
    "privacyTip": "Datenschutz-Tipp",
    "doNotReuseAddress": "Für Ihre Privatsphäre verwenden Sie jedes Mal eine neue Adresse, wenn Sie Bitcoin empfangen. Alte Adressen erneut zu verwenden, erleichtert es anderen, Ihre Transaktionen nachzuverfolgen.",
    "address": "Adresse",
    "forExample": "Zum Beispiel",
    "transactions": "Transaktion",
    "transactionProcessExplanationPart1": "Eine Bitcoin-Transaktion ist der Prozess, Bitcoin von einer Adresse zu einer anderen zu senden. Es funktioniert wie das Verschieben digitaler Münzen von Ihrer Wallet zu jemand anderem.",
    "transactionProcessExplanationPart2": "Jede Transaktion hat drei Hauptbestandteile:",
    "transactionProcessExplanationPart3": "<bold>Eingaben</bold> - die Bitcoin, die Sie bereits besitzen (Ihre UTXOs).",
    "transactionProcessExplanationPart4": "<bold>Ausgaben</bold> - wohin der Bitcoin geht (die Empfängeradresse und, falls nötig, Ihre Wechseladresse).",
    "transactionProcessExplanationPart5": "<bold>Gebühr</bold> - ein kleiner Betrag, der an Miner gezahlt wird, damit sie Ihre Transaktion in die Blockchain aufnehmen.",
    "confirmTransactions": "Transaktionen jetzt bestätigen - sofortiges Mining",
    "inputs": "Eingaben",
    "outputs": "Ausgaben",
    "yourTransactionWaiting": "Ihre Transaktion wartet auf die Bestätigung",
    "donate": "Spenden",
    "sendMeSats": "Wenn Ihnen diese App nützlich ist, senden Sie mir ein paar Sats. Vielen Dank im Voraus!",
    "enterFullscreen": "Vollbildmodus aktivieren",
    "exitFullscreen": "Vollbildmodus beenden",
    "disclaimer": "Haftungsausschluss",
    "disclaimerPart1": "Willkommen bei <bold>TX Flow</bold>. Diese Anwendung ist <bold>nur zu Bildungs- und Übungszwecken</bold> gedacht.",
    "disclaimerPart2": "Alle Bitcoin-Salden, Transaktionen und Wallets in diesem Simulator sind <bold>vollständig fiktiv</bold> und existieren nicht im echten Bitcoin-Netzwerk.",
    "disclaimerPart3": "Sie können hier kein echtes Bitcoin senden oder empfangen. Dieses Tool dient <bold>nur dazu, den Umgang mit Bitcoin-Transaktionen in einer sicheren Demo-Umgebung zu üben</bold>.",
    "disclaimerPart4": "Ich verstehe und stimme zu, dass dies eine Demo ist und kein echtes Bitcoin verwendet wird.",
    "continue": "Weiter",
    "receiveAddressExplanationPart1": "Eine Empfangsadresse ist wie dein persönlicher Bitcoin-Briefkasten. Du kannst sie mit anderen teilen, damit sie dir Bitcoin senden können. Jede Adresse ist einzigartig, und die an sie gesendeten Coins erscheinen in deiner Wallet.",
    "receiveAddressExplanationPart2": "Es ist wichtig, die Adresse vor dem Teilen sorgfältig zu überprüfen - wenn sie falsch getippt oder kopiert wird, könnten die Bitcoins für immer verloren gehen. Für besseren Datenschutz ist es am besten, jedes Mal eine neue Adresse zu verwenden, anstatt alte erneut zu benutzen.",
    "gettingStarted": "Erste Schritte"
}
