{
    "exchange": "Váltó",
    "wallet": "Tárca",
    "unknown": "Ismeretlen",
    "unrecoverable": "Helyrehozhatatlan",
    "reset": "Visszaállítás",
    "settings": "Beállítások",
    "mode": "Mód",
    "basic": "Alap",
    "advanced": "Haladó",
    "unit": "Mértékegység",
    "cancel": "Mégsem",
    "transactionHistory": "Tranzakció Előzmények",
    "transactionFee": "Tranzakciós Díj",
    "toggleColorScheme": "Színséma váltása",
    "balance": "Egyenleg",
    "send": "Küldés",
    "receive": "Fogadás",
    "selectSenderAddress": "Küldő cím kiválasztása",
    "recipentAddress": "Címzett Címe",
    "copy": "Másolás",
    "copied": "Másolva",
    "receiveBitcoinToExchange": "Bitcoin Fogadása Váltóra",
    "sendBitcoinFromExchange": "Bitcoin Küldése Váltóról",
    "receiveBitcoinToWallet": "Bitcoin Fogadása Tárcába",
    "sendBitcoinFromWallet": "Bitcoin Küldése Tárcából",
    "yourUtxos": "Az Ön UTXO-i",
    "memoryPool": "Memória Medence",
    "sourceCode": "Forráskód",
    "noTransactionsFound": "Nem található tranzakció...",
    "pasteAddressHere": "Cím beillesztése ide",
    "setSpeedTo1x": "Sebesség beállítása 1x-re",
    "setSpeedTo10x": "Sebesség beállítása 10x-re",
    "learnMore": "Tudj meg többet",
    "amountToSend": "Küldendő összeg",
    "exchangeExplanationPart1": "A váltó egy olyan platform, ahol Bitcoint (és más kriptovalutákat) lehet venni, eladni vagy kereskedni hagyományos pénz (például USD, EUR) vagy más digitális eszközök felhasználásával. Úgy működik, mint egy piactér - befizeted a pénzt, majd azt felhasználhatod Bitcoin vásárlására, amit később kiutalhatsz a saját tárcádba.",
    "exchangeExplanationPart2": "Egy váltón <bold>nem te irányítod a privát kulcsokat</bold> a Bitcoinodhoz - a váltó tartja azokat helyetted. Ezért mondják: <italic>\"Nem a te kulcsod, nem a te Bitcoinod\"</italic> - ha nem te kezeled a kulcsokat, akkor a Bitcoinod felett sem rendelkezel teljes mértékben.",
    "walletExplanationPart1": "A pénztárca egy eszköz, amellyel Bitcoint tárolhatsz, küldhetsz és fogadhatsz. A váltóval ellentétben a pénztárca <bold>a privát kulcsokat a te irányításod alá adja</bold> - ami azt jelenti, hogy valóban a tiéd a Bitcoin. A pénztárcák lehetnek alkalmazások a telefonodon vagy számítógépeden (szoftveres tárcák), illetve speciális eszközök (hardveres tárcák). Ezért mondják: <italic>\"Nem a te kulcsod, nem a te Bitcoinod\"</italic> - mert ha a kulcsok nálad vannak, akkor a Bitcoin is a tiéd.",
    "walletExplanationPart2": "Maguk a Bitcoinok mindig a blokkláncon vannak, nem pedig a telefonodon vagy az eszközödön. A pénztárca csupán <bold>biztonságban tartja a privát kulcsodat</bold>. Ha elveszíted a pénztárcát, a hozzáférést visszaállíthatod a privát kulcs segítségével (ami általában 12 vagy 24 helyreállító szóként van leírva).",
    "recipientAddressExplanationPart1": "A fogadó cím olyan, mint a Bitcoin „bankszámlaszáma”. Ez mondja meg a hálózatnak, <bold>hova kell a Bitcoint küldeni</bold>.",
    "recipientAddressExplanationPart2": "Ebben a gyakorló alkalmazásban fogadó címet úgy szerezhetsz, hogy megnyitod a pénztárcádat, rákattintasz a „Fogadás” gombra, majd kimásolod a megjelenített címet. Illeszd be ide, hogy szimuláld a Bitcoin küldését a pénztárcádba.",
    "importantReminder": "Fontos emlékeztető",
    "doubleCheckAddress1": "Mindig ellenőrizd kétszer a fogadó címet, mielőtt Bitcoint küldesz. Már egyetlen hibás betű vagy szám is azt eredményezi, hogy a Bitcoin rossz helyre megy - és a tranzakciókat nem lehet visszavonni.",
    "language": "Nyelv",
    "dark": "Sötét",
    "light": "Világos",
    "blockchain": "Blokklánc",
    "blockchainExplanationPart1": "A Bitcoin blokklánc egy <bold>nyilvános könyv</bold>, amely nyilvántartja minden valaha történt Bitcoin-tranzakciót. Blokkokból áll, amelyek mindegyike egy adott időszakban történt, ellenőrzött <bold>tranzakciók</bold> listáját tartalmazza.",
    "blockchainExplanationPart2": "A blokkok egymás után kapcsolódnak, így létrehozva egy biztonságos <bold>blokkláncot</bold>. Ez a struktúra biztosítja az összes tranzakció integritását és időrendi sorrendjét.",
    "blockchainExplanationPart3": "Ha szeretnéd, te is <bold>letöltheted a teljes Bitcoin blokkláncot</bold>. Ehhez a Bitcoin szoftvert kell telepítened a számítógépedre, vagy használhatsz egy dedikált eszközt. Így önállóan ellenőrizheted a tranzakciókat, és közvetlenül részt vehetsz a Bitcoin-hálózat működésében.",
    "blockMiningTime": "Blokkbányászat Ideje",
    "blockMiningExplanation": "A Bitcoin bányászok átlagosan <bold>10 percenként</bold> találnak egy új blokkot. Ez a visszaszámláló ezt a ciklust szimulálja: amikor eléri a nullát, újraindul, ugyanúgy, ahogy minden új blokk után kezdődik egy új, körülbelül 10 perces várakozás a következő blokkra.",
    "utxo": "UTXO (Elköltetlen Tranzakciós Kimenet)",
    "utxoExplanationPart1": "Amikor Bitcoint kapsz, az úgynevezett UTXO-k formájában érkezik. Ezeket elképzelheted úgy, mint az aprópénzt a tárcádban: ha valaki küld neked 0,3 BTC-t, majd később 0,2 BTC-t, akkor a tárcádban két „érme” lesz (két UTXO). Amikor Bitcoint küldesz, a tárcád ezeket az érméket (UTXO-kat) használja fel bemenetként.",
    "utxoExplanationPart2": "A tranzakciós díj szempontjából számít, hány UTXO-d van - minél több UTXO-t kell felhasználni, annál magasabb lehet a díj, még akkor is, ha az összeg ugyanannyi. Ezért néha van értelme összevonni az UTXO-kat (a kisebbeket egy nagyobbá alakítani), amikor az alacsonyak a díjak.",
    "memoryPoolExplanationPart1": "Amikor Bitcoin tranzakciót küldesz, az nem megy rögtön a blokkláncra. Először egy várakozó helyre kerül, amit memóriapoolnak (vagy röviden <italic>mempool</italic>) hívunk. Gondolj rá úgy, mint a <bold>postai sorra</bold>: a tranzakció ott vár, amíg egy bányász fel nem veszi és be nem teszi a következő blokkba.",
    "memoryPoolExplanationPart2": "Ha <bold>magasabb díjat</bold> állítasz be, a tranzakciód általában gyorsabban kerül feldolgozásra. Ha a díj alacsony, hosszabb ideig is maradhat a mempoolban, amíg hely nem lesz.",
    "spent": "Elköltött",
    "unspent": "Elköltetlen",
    "xUnspentUtxo": "{{count}} elköltetlen UTXO",
    "xSpentUtxo": "{{count}} elköltött UTXO",
    "noUtxosAvailable": "Nincsenek elérhető UTXO-k...",
    "attention": "Figyelem",
    "doubleCheckAddress2": "Mindig ellenőrizd kétszer a címet, mielőtt megosztanád vagy pénzt küldenél. Ha a rossz címet használod, a Bitcoinod örökre elveszhet.",
    "privacyTip": "Adatvédelmi tipp",
    "doNotReuseAddress": "A magánéleted védelme érdekében minden alkalommal használj új címet, amikor Bitcoint kapsz. A régi címek újrahasználata megkönnyítheti mások számára a tranzakcióid követését.",
    "address": "Cím",
    "forExample": "Például"
}
