{
    "exchange": "Exchange",
    "wallet": "Wallet",
    "unknown": "Unknown",
    "unrecoverable": "Unrecoverable",
    "reset": "Reset",
    "settings": "Settings",
    "mode": "Mode",
    "basic": "Basic",
    "advanced": "Advanced",
    "unit": "Unit",
    "cancel": "Cancel",
    "transactionHistory": "Transaction History",
    "transactionFee": "Transcation Fee",
    "toggleColorScheme": "Toggle color scheme",
    "balance": "Balance",
    "send": "Send",
    "receive": "Receive",
    "selectSenderAddress": "Select sender address",
    "recipentAddress": "Recipient Address",
    "copy": "Copy",
    "copied": "Copied",
    "receiveBitcoinToExchange": "Receive Bitcoin to Exchange",
    "sendBitcoinFromExchange": "Send Bitcoin from Exchange",
    "receiveBitcoinToWallet": "Receive Bitcoin to Wallet",
    "sendBitcoinFromWallet": "Send Bitcoin from Wallet",
    "yourUtxos": "Your UTXOs",
    "memoryPool": "Memory Pool",
    "sourceCode": "Source code",
    "noTransactionsFound": "No transactions found...",
    "pasteAddressHere": "Paste address here",
    "setSpeedTo1x": "Set speed to 1x",
    "setSpeedTo10x": "Set speed to 10x",
    "learnMore": "Learn more",
    "amountToSend": "Amount to send",
    "exchangeExplanationPart1": "An exchange is a platform where you can buy, sell, or trade Bitcoin (and other cryptocurrencies) using regular money (like USD, EUR) or other digital assets. It works like a marketplace - you deposit money, then use it to purchase Bitcoin, which you can later withdraw to your own wallet.",
    "exchangeExplanationPart2": "On an exchange, <bold>you don't control the private keys</bold> to your Bitcoin - the exchange holds them for you. That's why people say <italic>\"Not your keys, not your Bitcoin\"</italic> - if you don't control the keys, you don't fully control your Bitcoin.",
    "walletExplanationPart1": "A wallet is a tool that lets you store, send, and receive Bitcoin. Unlike an exchange, a wallet gives <bold>you control of the private keys</bold> - which means you truly own your Bitcoin. Wallets can be apps on your phone/computer (software wallets) or special devices (hardware wallets). People say <italic>\"Not your keys, not your Bitcoin\"</italic> because with a wallet, the keys are yours - and so is your Bitcoin.",
    "walletExplanationPart2": "Your Bitcoin itself is always on the blockchain, not inside your phone or device. The wallet simply <bold> keeps your private key safe</bold>. If you lose the wallet, you can restore access using your private key (usually written as 12 or 24 recovery words).",
    "recipientAddressExplanationPart1": "The recipient address is like the \"bank account number\" for Bitcoin. It tells the network <bold>where the Bitcoin should be sent</bold>.",
    "recipientAddressExplanationPart2": "In this practice app, you can get a recipient address by going to your wallet, clicking \"Receive\", and then copying the address shown there. Paste that address here to simulate sending Bitcoin to your wallet.",
    "importantReminder": "Important Reminder",
    "doubleCheckAddress": "Always double-check the recipient address before sending Bitcoin. Even one wrong letter or number means the Bitcoin will go to the wrong place - and once sent, transactions cannot be reversed.",
    "language": "Language",
    "dark": "Dark",
    "light": "Light",
    "blockchain": "Blockchain",
    "blockchainExplanationPart1": "The Bitcoin blockchain is a <bold>public record book</bold> that keeps track of every Bitcoin transaction ever made. It is composed of blocks, each of which contains a list of verified <bold>transactions</bold> that occurred within a specific time frame.",
    "blockchainExplanationPart2": "Blocks are linked one after another, forming a secure <bold>chain of blocks</bold>. This structure ensures the integrity and chronological order of all transactions.",
    "blockchainExplanationPart3": "If you want, <bold>you can also download the entire Bitcoin blockchain</bold> yourself. To do this, you need to install Bitcoin software on your computer or use a dedicated device. This allows you to verify transactions independently and participate directly in the Bitcoin network.",
    "blockMiningTime": "Block Mining Time",
    "blockMiningExplanation": "Bitcoin miners find a new block roughly every <bold>10 minutes</bold>. This countdown simulates that cycle: when it reaches zero, it restarts — just like after each block, a new ~10-minute wait for the next block begins.",
    "utxo": "UTXO (Unspent Transaction Output)",
    "utxoExplanationPart1": "When you receive Bitcoin, it comes in pieces called UTXOs. You can think of them like coins in your wallet: if someone sends you 0.3 BTC and later another 0.2 BTC, your wallet is holding two “coins” (two UTXOs). When you send Bitcoin, your wallet uses these coins (UTXOs) as inputs.",
    "utxoExplanationPart2": "The number of UTXOs matters for the transaction fee - more UTXOs usually mean a higher fee, even if the total amount is the same. That's why it can sometimes make sense to consolidate your UTXOs (combine smaller ones into a bigger one) when fees are low.",
    "memoryPoolExplanationPart1": "When you send a Bitcoin transaction, it doesn't go straight into the blockchain. First, it enters a waiting area called the memory pool (or <italic>mempool</italic> for short). Think of it like a <bold>queue at the post office</bold>: your transaction waits there until a miner picks it up and includes it in the next block.",
    "memoryPoolExplanationPart2": "If you set a <bold>higher fee</bold>, your transaction usually gets picked faster. If the fee is low, it may stay longer in the mempool until space is available.",
    "spent": "Spent",
    "unspent": "Unspent",
    "xUnspentUtxo": "{{count}} unspent UTXO(s)",
    "xSpentUtxo": "{{count}} spent UTXO(s)",
    "noUtxosAvailable": "No UTXOs available..."
}
